// 召唤兽每个非特殊技能附带的概率
export const MONSTER_OPTIONAL_SKILL_RATE = 0.25;
// 召唤兽第一个非特殊技能附带的概率
export const MONSTER_FIRST_OPTIONAL_SKILL_RATE = 0.3;
// 召唤兽每个特殊技能附带的概率
export const MONSTER_SPECIAL_SKILL_RATE = 0.1;
// 合宠出现不是参与合宠召唤兽的概率
export const MIX_MONSTER_NOT_PARTICIPATE_RATE = 0.2;
// 合宠出现的大海龟的概率（不是大海龟则是泡泡）
export const MIX_MONSTER_TURTLE_RATE = 0.8;
// 合宠出现野生的概率
export const MIX_MONSTER_WILD_RATE = 0.25;

// 必带技能覆盖几率
export const REQUIRED_SKILL_COVER_RATE = 0.2;
// 非必带技能覆盖几率
export const OPTIONAL_SKILL_COVER_RATE = 1;
// 打书添加技能几率
export const ADD_SKILL_RATE = 0.1;


// 每个技能数量档位的概率
export const MIX_MONSTER_SKILL_NUM_RATE = [
  0.22,
  0.17,
  0.15,
  0.14,
  0.1285,
  0.12,
  0.05,
  0.015,
  0.005,
  0.001,
  0.0005,
]

// 特殊技能
export const SPECIAL_SKILLS = []


// 召唤师技能排序
export const SKILL_SORT = [
  "416",
  "640",
  "320",
  "576",
  "577",
  "417",
  "578",
  "641",
  "418",
  "321",
  "322",
  "323",
  "579",
  "324",
  "419",
  "420",
  "421",
  "325",
  "422",
  "552",
  "551",
  "326",
  "327",
  "329",
  "424",
  "328",
  "425",
  "553",
  "554",
  "330",
  "331",
  "332",
  "333",
  "650",
  "572",
  "426",
  "427",
  "428",
  "429",
  "462",
  "430",
  "431",
  "432",
  "433",
  "338",
  "301",
  "334",
  "302",
  "335",
  "303",
  "337",
  "304",
  "401",
  "305",
  "689",
  "434",
  "402",
  "306",
  "626",
  "624",
  "690",
  "336",
  "339",
  "403",
  "435",
  "595",
  "307",
  "304",
  "628",
  "627",
  "308",
  "436",
  "596",
  "405",
  "629",
  "660",
  "661",
  "309",
  "438",
  "406",
  "407",
  "597",
  "310",
  "503",
  "502",
  "501",
  "504",
  "598",
  "440",
  "439",
  "441",
  "343",
  "311",
  "408",
  "505",
  "312",
  "409",
  "313",
  "410",
  "314",
  "315",
  "571",
  "411",
  "443",
  "423",
  "316",
  "412",
  "413",
  "317",
  "673",
  "445",
  "671",
  "415",
  "638",
  "510",
  "573",
  "414",
  "575",
  "318",
  "319"
]

// 互斥技能
/**
 * 否定信仰(包括高低)与以下技能冲突：
 * 　感知、隐身、驱鬼、雷属性吸收、土属性吸收
 * 　鬼魂术、神佑复生、神迹、水属性吸收、火属性吸收
 * 　其他说明:
 * 　以上都包括高、低技能
 */
export const MUTEX_SKILLS = [
  // 鬼魂术 神佑
  ["312", "311"],
  // 鬼魂术 高级神佑
  ["312", "411"],
  // 高级鬼魂术 神佑
  ["412", "311"],
  // 高级鬼魂术 高级神佑
  ["412", "411"],
  // 否定信仰 感知
  ["323", "308"],
  // 否定信仰 高级感知
  ["323", "408"],
  // 否定信仰 隐身
  ["323", "307"],
  // 否定信仰 高级隐身
  ["323", "407"],
  // 否定信仰 驱鬼
  ["323", "313"],
  // 否定信仰 高级驱鬼
  ["323", "413"],
  // 否定信仰 雷属性吸收
  ["323", "330"],
  // 否定信仰 高级雷属性吸收
  ["323", "430"],
  // 否定信仰 土属性吸收
  ["323", "331"],
  // 否定信仰 高级土属性吸收
  ["323", "431"],
  // 否定信仰 水属性吸收
  ["323", "332"],
  // 否定信仰 高级水属性吸收
  ["323", "432"],
  // 否定信仰 火属性吸收
  ["323", "333"],
  // 否定信仰 高级火属性吸收
  ["323", "433"],
  // 否定信仰 鬼魂术
  ["323", "312"],
  // 否定信仰 高级鬼魂术
  ["323", "412"],
  // 否定信仰 神迹
  ["323", "319"],
  // 否定信仰 高级神迹
  ["323", "419"],
  // 否定信仰 神佑
  ["323", "311"],
  // 否定信仰 高级神佑
  ["323", "411"],
  // 高级否定信仰 神佑
  ["423", "311"],
  // 高级否定信仰 高级神佑
  ["423", "411"],
  // 高级否定信仰 感知
  ["423", "308"],
  // 高级否定信仰 高级感知
  ["423", "408"],
]
